void main(List<String> arguments) {
  // 1) Дан массив с числами [1, 7, 12, 3, 56, 2, 87, 34, 54]. Выведите в конслоли превый, пятый и последний элемент списка.
  print('Задание 1');
  List task1 = [1, 7, 12, 3, 56, 2, 87, 34, 54];
  print(
      'Первый элемент - ${task1.first}, пятый элемент - ${task1.elementAt(4)}, последний элемент ${task1.last}');
  print('');

// 2) Даны два массива с числами [3, 12, 43, 1, 25, 6, 5, 7] и [55, 11, 23, 56, 78, 1, 9]. Объедените данные массивы и выведите в консоли.
  print('Задание 2');
  List mas1 = [3, 12, 43, 1, 25, 6, 5, 7];
  List mas2 = [55, 11, 23, 56, 78, 1, 9];
  mas1.addAll(mas2);
  print(mas1);
  print('');

// 3) Дан массив ['a','d','F','l','u','t','t','e','R','y','3','b','h','j'], из данного массива необходимо вывести в консоли массив ['F','l','u','t','t','e','R']
  print('Задание 3');
  List task3 = [
    'a',
    'd',
    'F',
    'l',
    'u',
    't',
    't',
    'e',
    'R',
    'y',
    '3',
    'b',
    'h',
    'j'
  ];
  print(task3.sublist(2, 9));
  print('');

  // 4) выведите true если массивы содержит цифру 3 [1, 2, 3, 4, 5, 6, 7], также покажите первый и последний элемент массива и его длину
  print('Задание 4');
  List task4 = [1, 2, 3, 4, 5, 6, 7];
  print(
      'Содержит ли массив число 3 - ${task4.contains(3)}, Первый элемент массива - ${task4.first}, Последний эллемент массива - ${task4.last}, Длинна массива - ${task4.length}');
  print('');

  /* 5) У вас есть список со значениями = [601 123, 2, "dart", 45, 95, "dart24", 1];
  Попробуйте определить содержит ли список такие элементы как: 
  1 – ‘dart’;
  2 – 951;
  Вы должны получить принты для задач:
  1 – true
  2 – false
  3 - если содержится и dart, и 951 то получить резултать true*/
  print('Задание 5');
  List task5 = [601, 123, 2, "dart", 45, 95, "dart24", 1];
  print('${task5.contains("dart")}');
  print('${task5.contains(951)}');
  print('${task5.contains(951) & task5.contains("dart")}');
  print('');

  /* 6) У вас есть список со значениями = [‘post’, 1, 0, ‘flutter’];
  И переменная String myDart = ‘Flutter’;
  Попробуйте определить содержит ли список значение переменной myDart (Именно с большой буквы).
  Вы должны получить print со значением true; */
  print('Задание 6');
  List task6 = ['post', 1, 0, 'flutter'];
  String myDart = 'Flutter';
  print(task6.contains(myDart.toLowerCase()));
  print('');

  /* 7) У вас есть список со значениями [“I”, “Started", "Learn", "Flutter", "Since", "April"];
  И переменная String myFlutter = ‘’;
  Задача: Объединить все элементы массива в одну строку и разделить каждое слово символом ‘*’ и сделать принт перменной myFlutter;
  Print(myFlutter);
  В консоли вы должны получить: 
  I * Started * Learn * Flutter * Since * April */
  print('Задание 7');
  List task7 = ["I", "Started", "Learn", "Flutter", "Since", "April"];
  String myFlutter = '';
  myFlutter = task7.join(' * ');
  print(myFlutter);
  print('');

  /* 8) У вас есть массив со значением = [1, 9, 3, 195, 202, 2, 5, 7, 9, 10, 3, 15, 0, 11];
  Ваша задача провести сортировку массива, чтобы все элементы начинались по возрастающей. Вы должны получить в консоли:
  [0, 1, 2, 3, 3, 5, 7, 9, 9, 10, 11, 15, 195, 202] */
  print('Задание 8');
  List task8 = [1, 9, 3, 195, 202, 2, 5, 7, 9, 10, 3, 15, 0, 11];
  task8.sort((a, b) => a.compareTo(b));
  print(task8);
}
